
<?php include "timerajax.php";?>
<div class="container">


    <h2>Как поменять карьерный путь в ИТ внутри компании</h2>
    <div id="content"></div>
    <h5><img src="stuff/img/Dude.jpg"height="100px" width="100px">Александр Фикс.Специалист по продвижению решений в КРОК Облачные сервисы.</h5>
    <p>В среднем айтишники меняют компанию каждые 2–5 лет. Но в КРОК они работают и по 10–15: занимаются разными проектами, меняют карьерные треки и не перестают развиваться.

        Можно ли кардинально поменять карьеру не увольняясь? Как это сделать? И как понять, что пора повернуть трек? Разберёмся вместе со специалисто
        м по продвижению облачных решений КРОК Сашей Фиксом.</p>
    <h3>Про свой карьерный трек</h3>
    <p>Я работаю в КРОК почти 5 лет, и за это время успел побыть младшим инженером, освоить сложное оборудование и стать сертифицированным тренером по работе с ним. А теперь поменял карьеру. Но обо всём подробнее
        Я пришёл в КРОК на третьем курсе на позицию стажёра — с перспективой дорасти до инженера. Сначала занимался серверами, потом перешёл в системы хранения данных.
        Довольно скоро я начал работать с оборудованием вендора. А затем стал проводить по нему обучающие тренинги и вебинары — для коллег по рынку и заказчиков.
        Быть узким специалистом в конкретном направлении — это неплохой вариант, и некоторые коллеги так и строят карьеру. Но мне всегда было интересно разностороннее развитие. К тому же я довольно быстро понял, чего хочу от работы, и не был готов надолго «зависать» на одном и том же.
        Так что спустя 4,5 года я решил — стоит попробовать себя в чём-то ещё. Долго думал, в какую сферу уйти: что мне интересно, что заряжает. В итоге остановился на продакт-менеджменте. В команде Облака КРОК в это время как раз искали специалиста — и я увидел крутую возможность сменить карьерный путь.</p>
    <h3>Переход в команду КРОК Облачные сервисы</h3
    <p>Мой ресурс-менеджер (руководитель, помощник и драйвер развития) всеми силами помогал мне в переходе: помог разобраться, что я хочу делать, и состыковал с будущим руководителем. Так что разговоров в стиле «пожалуйста, отпусти меня» не было. Да и вряд ли они могли быть — в КРОК очень ценится личное развитие, и руководители не станут тебя тормозить, если ты захочешь попробовать себя в новом.

        Затем начался переход. Сперва мы встретились с новым ресурс-менеджером и обсудили будущую работу. Какой я вижу свою карьеру? Какими — свои будущие задачи? Нравятся ли они мне? Готов ли я ими заниматься?

        Потом стал приходить на первые рабочие встречи в новую команду, следил, что и как делают ребята, вникал в процессы. Наконец, начал забирать какие-то задачи, постепенно уменьшал объём работы по старому направлению (я ещё числился в команде инженеров) и передавал дела.

        Параллельно я проходил курс по созданию продукта, который мне рекомендовал новый тимлид. И изучал источники, которыми делились коллеги.

        Переход длился несколько месяцев. Всё это время меня поддерживала новая команда: отвечала на вопросы, которые возникали по ходу работы, и помогала с задачами.</p>
    <h3>Как поменять карьеру</h3>
    <p>А теперь расскажу о том, что делать, если хочется сменить трек.

        Во-первых, убедиться, что ты закрыл все висящие на тебе задачи. И что коллеги могут тебя заменить (это особенно важно, если хочешь поменять трек внутри компании).

        Во-вторых, понять, чем ты хочешь заниматься, и постепенно это изучить. Собирать материалы по теме, проходить обучающие курсы, обращаться к коллегам, набираясь от них опыта.

        В-третьих, быть открытым. Общение с ребятами из разных команд — в офисе, в столовой или возле лифта — поможет найти карьерные возможности. Вдруг в компании как раз ищут специалиста по интересному тебе направлению.Также важно постоянно искать челленджи, которые помогут прокачать те или иные навыки. Например, я сам приходил к коллегам и спрашивал, что могу сделать, чтобы развить навык публичных выступлений.</p>
    <h3>А чего не стоит делать</h3>
    <p>Перед тем как искать новое место работы, — поищите возможности внутри своей компании.

        Так исчезнут многие проблемы с адаптацией: не надо разбираться с тем, как строятся внутренние процессы, какая иерархия внутри компании, что нужно делать, чтобы утвердить то или иное действие, и так далее. А рядом будет уже знакомая команда, к которой можно, не стесняясь, обратиться за помощью.

        К тому же, по-моему, если прыгать из компании в компанию, сложнее полноценно развиваться.

        Кроме того, не нужно менять трек, если первые рабочие дни были «так себе» (например, я в первые два дня стажировки был уверен, что меня уволят). Стоит провести на одном месте работы хотя бы месяц — чтобы разобраться в своих задачах и понять, кто из сотрудников чем занимается.

        Плюс за это время ты привыкаешь к коллективу, можешь сосредоточиться на работе и понять, хочешь ты ей заниматься или нет.

        Наконец, не надо мотивировать себя на переход искусственно. Если ты постоянно ищешь поводы поменять карьеру, то стоит задуматься, а точно ли новый трек — это твоё.</p>
    <h3>Что в итоге</h3>
    <p>Как поменять карьерный трек внутри компании?
    <ul>
        <li>Расширять кругозор и постоянно интересоваться новым — чтобы понять, что тебе интересно.
        </li>
        <li>Налаживать связи с коллегами — от них всегда можно узнать, чем занимаются сотрудники в разных департаментах. К тому же знакомая команда всегда поможет с переходом.
        </li>
        <li>И не бояться.
        </li>
    </ul></p>

    <div style="position: relative;text-align: right"><?php include("likestuff.php");?> <a class="shinestuff" href="https://tproger.ru/articles/kak-pomenjat-karernyj-put-v-it-vnutri-kompanii/">Источник</a></div>
</div>
<?php include("footer.php");?>
</body>
</html>