
<?php include "timerajax.php";?>
<div class="container">
    <h2>Ключевые soft skills для IT-специалиста за рубежом</h2>
    Опрос рекрутеров в 2021 году показал, что зарубежные компании хотят видеть в сотрудниках независимость,
    умение работать в команде, гибкость и разные подходы к решению проблем. В этой статье я расскажу,
    какие «гибкие навыки» нужны именно ИТ-специалистам за границей и как правильно такие навыки преподнести.
    <p>В межсезонье сотрудники чаще задумываются о том, чтобы сменить работу. В их числе — IT-специалисты.
        Мы попросили руководителей отделов разработки и HR-менеджеров рассказать, на какие софт-скилы они обращают внимание при найме.</p>
    <p>
    <h5><img src="stuff/img/jl.jpg"height="100px" width="100px">Юлия Cамойлова.Карьерный консультант EP Advisory.</h5>
    </p>
    <h3>Soft и hard skills: в чем разница?</h3>
    <p>Все навыки специалистов можно разделить на две категории:
    <p><strong>Hard skills</strong> — все технические навыки, без которых специалист не смог бы выполнять свою работу. Для IT-специалистов это:
        языки программирования, фреймворки, системы виртуализации, принципы построения сетей и так далее. Для подтверждения таких навыков вас могут попросить решить
        кейс прямо на собеседовании, подтвердить прохождение курсов или рассказать примеры ситуаций с предыдущих мест работы.</p>
    <p><strong>Soft skills</strong> — это личностные качества, которые характеризуют манеру поведения на работе, они связаны с профессией только косвенно.
        Они не такие конкретные как hard skills, поэтому и получили название soft (мягкие). Плюс этих навыков в том, что они не относятся к конкретной позиции
        в компании и узкому кругу задач, а скорее характеризуют весь ваш путь и помогают достичь высоких результатов в карьере.
        Примеры важных soft skills: лидерские качества, адаптивность, стрессоустойчивость, креативность, критичный подход, умение
            работать в команде.</p>
    <h3>Для чего вообще нужны soft skills?</h3>
    <p>В первую очередь, для получения этой самой заветной должности за рубежом с релокацией. Когда я готовлю клиентов к собеседованиям в Британии
        и Европе, очень часто вижу, что IT-специалисты недооценивают именно важность гибких навыков при отборе.</p>
    <div class="trblockquote">На soft skills обязательно будут смотреть во время собеседования — как на основе вашего общения с рекрутером
        или менеджером, так и задавая competency-based questions, вопросы о вашем предыдущем опыте.</div>
    <p>Самый главный из таких навыков — коммуникация, то есть умение слышать и давать обратную связь, доносить свою позицию, находить общие решения.
        Этот навык важно показать всем специалистам в области IT: разработчикам, архитекторам, инженерам, продакт менеджерам, проектным менеджерам.
        Эффективная коммуникация в корпорациях,
        хотя не первый взгляд это и не очевидно, помогает находить самые лучшие решения для рабочих задач.
        Личностные качества также помогают в других рабочих вопросах.</p>
    <h3>1. Успешность в команде</h3>
    <p>Умение понимать и взаимодействовать с другими людьми способствует положительному микроклимату, в котором легко рождаются новые идеи.
        В зарубежных корпорациях обычно понимают, что проще взять человека с хорошими коммуникативными качествами, но без некоторых технических навыков,
        чем отличного профессионала, не умеющего общаться с коллегами.
        Технические навыки можно подтянуть с помощью обучения, а вот перестройка личности требует более глубокой работы.
        Для успешного развития в команде стартапа вам наряду с коммуникацией также пригодятся: инициативность, стрессоустойчивость и способность принимать решения.</p>
    <h3>2. Быстрый рост по карьерной лестнице</h3>
    <p>Программист, который занимает активную позицию не только в своем проекте, но и смежных, который умеет слышать, доносить информацию и принимать решения
        имеет огромные шансы перейти на руководящую роль в проекте.<div></div>
        Менеджер проекта, который активно обучается и прислушивается к мнению коллег, даже при пробелах в технических знаниях будет намного ценнее для компании,
        чем тот, кто сосредоточен лишь на выполнении своих задач. Не все специалисты начального звена могут
        развивать продукт, но прелесть soft skills в том, что именно они помогают привлекать дополнительные мнения для решения неординарных задач.</p>
    <h3>3. Репутация</h3>
    <P>Если вас знают как доброжелательного, приятного профессионала, то обязательно порекомендуют
        на должность, к вам придут за советом, вы будете получать заказы через сарафанное радио.</P>
    <div class="trblockquote">Рынок труда в Великобритании и Западной Европе не зря называется “реферальным”: в большинстве
        компаний предусмотрены бонусы сотруднику за рекомендацию подходящего кандидата. Если вы получите реферал на открытую вакансию,
        вас с вероятностью 99% пригласят хотя бы на первое собеседование (а иногда и его получить очень сложно!). Поэтому человеку со слабо
        развитыми личностными качествами бывает довольно проблематично найти работу — его резюме просто пропускают в общем потоке.
    </div>
    <h3>4. Адаптация к новым условиям</h3>
    <p>При смене города или страны меняется все — от вида из окна до совершенно другой корпоративной культуры. Адаптивность и soft skills в этом случае выходят на первый план,
        а именно: умение понять коллег с другим менталитетом, бодрость духа, самоорганизация, проактивность, нетворкинг.</p>
    <h3>Какие именно навыки нужны?</h3>
    <div class="trblockquote">
        Советую начать с того, какими талантами и навыками вы уже обладаете. Возьмите бумагу и карандаш и выпишите все,
        не думая о том, какую должность вам хотелось бы получить. Можете сразу разделить навыки на несколько колонок:<div></div>
        – коммуникативные навыки,<div></div>
        – управление проектами,<div></div>
        – технические умения.<div></div>
    </div>
    <p>Теперь самое время подумать, какие навыки стоит включить в резюме, отталкиваясь от ваших целей. К примеру,
        в стартапах предпочитают совсем другие личностные качества, чем в крупных корпорациях.
        Как определить, какие навыки важны для конкретной должности? Вот пример анализа случайной вакансии в Лондоне,
        iOS Developer в скейл-апе (открыта в мае 2022 года):</p>
    <div class="text-center"><img src="stuff/img/example.jpg" ></div>
    <div> </div>
    <p>  -Из описания вакансии видим, что в такой молодой и маленькой компании будут часто меняться задачи. Значит, в процессе отбора можно подчеркнуть,
        что вы: adaptable, stress-resilient, умеете работать в fast-paced environment и знаете, how to deal with competing priorities and challenging timescales.<div></div>
        -Еще одна важная подсказка: вам предстоит работать в небольшой, но мультинациональной команде. Важно сделать акцент на навык коммуникации
        (особенно с представителями офисов в разных странах, если у вас есть такие примеры), а также указать любой предыдущий опыт работы в стартапе или малом бизнесе.<div></div>
        -И наконец, работодателю явно хочется видеть интерес к дизайну и искреннее желание сделать отличный, интуитивный продукт. Можно сказать,
        что вы способны to see the big picture. Вы внимательны к деталям, meticulous and results-driven.</p>
    <p>Таким же образом можно проанализировать любую другую вакансию, обращая внимание на особенности компании, отдела и ваших задач в этой роли. Если вы видите
        откровенное несоответствие запросов компании и ваших личностных качеств, то лучше подумать, стоит ли подаваться на эту
        вакансию. Например, в компании приняты частые обсуждения, брейнстормы, задачи распределяются горизонтально и даже рядовые
        сотрудники вовлечены в формулировку общих целей компании. А вы привыкли к понятной иерархии и вообще гораздо эффективнее
        работаете в одиночестве. Тогда нужно принять для себя решение: развивать новые личностные качества или поискать более подходящую должность.</p>
    <h3>Как прописывать soft skills в резюме?</h3>
    <P>В самом начале резюме сделайте раздел Summary или Profile, где в 3–5 строчках расскажете об опыте и вашем соответствии позиции, на которую подаетесь.
        Здесь всегда есть соблазн указать что-то общее: аккуратность, организованность, внимание к деталям… но лучше указать несколько релевантных
        для роли навыков (опираясь на пример анализа выше), на которые намекает или упоминает напрямую описание вакансии.</P>
    <div class="trblockquote">При этом важно показать soft skills и через основную часть резюме, где вы рассказываете про компетенции и опыт. Упомяните среди достижений, как вы организовали рабочий процесс с сильной экономией времени для компании. Или как вы презентовали свои решения клиентам или руководству и помогли бизнесу получить новый проект.</div>
    <P>Если не очень получается показать личностные качестве через резюме, пишите в сопроводительном письме. Так вы не просто расскажете о своих навыках, но и покажете их через конкретные примеры, что гораздо убедительнее, чем просто перечисление.</P>
    <h3>Как проверяют soft skills на собеседовании?</h3>
    <div class="trblockquote">Важнейший этап отбора соискателей — это поведенческое интервью или интервью по компетенциям. Его включают в отбор как раз для того, чтобы проверить ваши личностные качества. Вопросы на этом этапе задаются предельно конкретные, чаще всего они начинаются с “Как вы поступали в ситуации, когда..?” или “Что бы вы сделали, если..? </div>
    <p>Примеры вопросов на интервью по компетенциям:</p>
    <ul>
        <li>Сталкивались ли вы с нестандартными задачами? Расскажите о такой ситуации.</li>
        <li>Приходилось ли вам решать сложные задачи на последней работе? Приведите пример.</li>
        <li>Расскажите, как вы действовали, когда у вас был конфликт с другим сотрудником.</li>
    </ul>
    <p>В идеале, в ответ на эти вопросы нужно приводить емко описанные примеры по<strong> структуре STAR (Situation, Task, Action, Result):</strong></p>
    <ul>
        <li>1.О какой ситуации вы сейчас говорите? Что это была за компания, департамент, ваша роль?</li>
        <li>2.Какая задача стояла перед вами и в чем была проблема?</li>
        <li>3.Как вы подошли к решению этой задачи, что вы сделали?</li>
        <li>4.Какой результат был в итоге? Например, проблема безболезненно решилась с минимальными потерями для
            компании или улучшились отношения с другим отделом или работодатель получил высокую прибыль.</li>
    </ul>
    <div class="trblockquote">Заготовьте 10–12 коротких историй для описания разных навыков, используя подходящую лексику.
        Иначе при таком вопросе легко растеряться и дать очень поверхностный и неконкретный ответ.
    </div>
    <p>В моей практике был случай проведения поведенческого интервью, когда соискатель на каждый вопрос отвечал около 10 минут. Когда мы ему намекнули, что нужно чуть больше сконцентрироваться на сути, он сразу стал отвечать короче и по делу.
        Тем самым он показал такие качества как умение слушать и адаптивность, и в конечном итоге, получил оффер.</p>
    <h3>Оценочные центры и soft skills</h3>
    <p>Assessment centres — это обычная практика для крупных корпораций на финальной стадии отбора соискателей, когда их осталось уже не так много. Кандидатов приглашают физически прийти в офис или виртуально, решить несколько тестов и разного рода задач. Также обычно есть групповое задание, где всех оценивают по определенным шкалам soft skills, которые очень важны компаниям.
    </p>
    <div class="trblockquote">Расскажу пример группового упражнения из моей практики проведения центра оценки. В офис приходит 5–7 кандидатов, которым сообщаются условия задачи: «У компании есть средства в размере ХХ и они хотят вложить их в интересный проект». Каждый участник получает брифинг на свой проект, знакомится с деталями и презентует их остальным. Через 30 минут кандидаты должны решить, в какой проект вкладывать деньги. Всё это время в комнате находится несколько рекрутеров, которые наблюдают за поведением кандидатов.

    </div>
    <p>В рамках этого задания оцениваются:

    </p>
    <ul>
        <li>Коммуникативные навыки кандидатов (как общаются внутри группы, как презентуют проект).
        </li>
        <li>Навыки командной работы (например, сразу видны кандидаты, которые упорно продвигают свою точку зрения и не хотят идти на компромисс).
        </li>
        <li>Адаптивность и открытость к чужому мнению. Важно понимать, что когда принятые соискатели будут работать в команде, они скорее всего будут работать по методологии Agile, где меняются как требования, так и приоритеты. Поэтому нужно показать свою способность изменить мнение и подстроиться под группу, если это необходимо.
        </li>
    </ul>
    <h3>Как улучшить soft skills?
    </h3>
    <p>Все начинается с желания. Подумайте, какие навыки вам хотелось бы улучшить и пропишите самые комфортные способы для вас. Примеры:

    </p>
    <ul>
        <li>1.Пробуйте менять впечатление недовольных клиентов через хорошие, дружелюбные отношения. Вы прокачаете креативность,
            стрессоустойчивость, коммуникативные навыки.
        </li>
        <li>2.Научитесь решать какую-то типичную проблему на работе и поделитесь своей экспертизой с коллегами. Вы прокачаете
            навыки кризис-менеджмента, коучинговые навыки, коммуникацию, критическое мышление.
        </li>
        <li>3.Стройте гипотезы по развитию продукта/улучшению функциональности и оговаривайте это с командой. Вы прокачаете проактивность, креативность, коммуникацию.
        </li>
        <li>4.Участвуйте в конференциях в качестве спикера. Вы прокачаете уверенность в себе, коммуникацию, организованность, структурирование информации.
        </li>
        <li>5.Участвуйте в хакатонах. Вы сможете прокачать лидерские навыки, тайм-менеджмент, творческое мышление.
        </li>
        <li>6.Поставьте себе цели в самообразовании. Поймите, в чем вам хотелось бы развиваться, и запишитесь на курсы,
            тренинг, начните изучать (улучшать) иностранный язык. Помимо hard skills вы сможете прокачать креативность, уверенность, целеустремленность.
        </li>

    </ul>
    <p>В целом, компании ищут не самого умного и подкованного во всем кандидата, а наиболее подходящего под конкретную
        роль c определенными задачами. Личностные навыки при этом играют огромную роль. Внимательно читайте описания вакансий,
        адаптируйте свое резюме под каждую многообещающую должность, изучайте ценности и корпоративную культуру компаний — через публикации
        в их соцсетях и блоге, официальный сайт или через знакомых, работающих там.

    </p>
    <p style="background-color:#d2d2d2;border-radius: 3px ">Об авторе: Юлия Самойлова обладает 10-летним опытом работы в IT в таких
        компаниях как Accenture, WhatsApp и BT. Сейчас живет и работает в Лондоне, параллельно помогая русскоязычным специалистам найти
        работу в Великобритании и Европе как карьерный консультант EP Advisory.

    </p>
    <div style="position: relative;text-align: right"><?php include("likestuff.php");?> <a class="shinestuff" href="https://tproger.ru/articles/kljuchevye-soft-skills-dlja-it-specialista-za-rubezhom/">Источник</a></div>
</div>
<?php include("footer.php");?>
</body>
</html>