<?php include "timerajax.php";?>
<div class="container">
    <h2>Освоить веб-дизайн с нуля: что читать и где учиться?</h2>
    <p>Рассказываем, кто такой веб-дизайнер, чем занимается и где этому учиться. Бонусом — немного истории.</p>
    <h3>Что такое веб-дизайн</h3>
    <p>В начале нулевых веб-дизайн и веб-разработка зачастую шли нераздельно. Но технически веб-дизайн — это подкатегория веб-разработки,
        которая в первую очередь относится к видимой части сайтов, онлайн-сервисов и приложений.
        Веб-дизайн — проектирование и визуализация продуктов, их макетов и прототипов.
        Сегодня веб-дизайн не связан с кодом и включает в себя несколько аспектов:</p>
    <p><ul>
        <li>
            визуализация прототипа,
        </li>
        <li>проектирование сайта или приложения,
        </li>
        <li>графический дизайн,
        </li>
        <li>взаимодействие с пользователем.
        </li>
    </ul>А профессиональный веб-дизайнер вдобавок знает и понимает основные принципы сайтостроения, разбирается в вёрстке и маркетинге. Научиться веб-дизайну с нуля можно за год на курсе «Веб-дизайн с нуля до PRO» онлайн-университета Skillbox.</p>
    <p><img src="stuff/img/smallmap.jpg"></p>
    <p class="text-center">Карта навыков веб-дизайнера</p>
    <h3>Чем занимается
        веб-дизайнер</h3>
    <p>Веб-дизайнер всегда в курсе новейших технологий, знает, куда двигается индустрия, обладает хорошим эстетическим вкусом и постоянно его развивает.

        Во-первых, веб-дизайнер — это проектировщик, инженер. Он продумывает логику сайта, проектирует рабочий прототип, тестирует его, чтобы тот получился функциональным, и лишь после этого «оживляет» графику.

        Во-вторых, дизайнер применяет на практике принципы юзабилити, чтит стандарты, использует анимацию, подбирает шрифты. Он также продумывает, как пользователь будет взаимодействовать с сайтом, объясняет расположение элементов на странице и отстаивает визуальные решения перед клиентом.

        В отличие от графического или UX/UI-дизайнера, веб-дизайнер совмещает функции менеджера и дизайнера. Работа веб-дизайнера состоит из нескольких этапов, о которых мы рассказали ниже. И дополнили рассказ ссылками на наши статьи.</p>
    <p>
        <ul>
        <li>
            1.Встреча с клиентом и составление технического задания.
        </li>
        <li>
            2.Обсуждение решений с командой.
        </li>
        <li>
            3.Проектирование логической структуры сайта.
        </li>
        <li>
            4.Создание динамичного прототипа.
        </li>
        <li>
            5.Получение обратной связи от заказчика.
        </li>
        <li>
           6.Визуальное оформление сайта: подбор шрифтов, цветовой палитры, создание анимации, подбор изображений и иллюстраций, вёрстка текста.
        </li>
        <li>
            7.Рабочий макет сайта и его тестирование.
        </li>
        <li>
            8.Веб-разработка, запуск сайта и анализ его работы по метрикам.
        </li>
    </ul>
    </p>
    <h3>Где учиться
        на веб-дизайнера?</h3>
    <p>По запросу «веб-дизайнер» на сайте hh.ru открыто около 800 вакансий, из которых бóльшая часть — в сфере IT и диджитал. Спрос есть и продолжает расти.
        Веб-дизайнер — довольно молодая профессия, получить узкоспециализированные знания по этой специальности в российских вузах проблематично. Однако базовые знания касательно области компьютерной графики, изображений и анимаций вполне реально.
    Помимо знаний полученных в вузах существует огромное количество курсов и статей касательно веб-дизайна в целом или отдельных его частей.На нашем сайте вы можете найти много интересных статей по рассказываемой теме
    </p>
    <div style="position: relative;text-align: right"> <?php include("likestuff.php");?><a class="shinestuff" href="https://skillbox.ru/media/design/veb_dizayn_s_nulya/">Источник</a></div>
</div>
<?php include("footer.php");?>
</body>
</html>